<?
session_start();
session_unregister('textarea');
$_SESSION['textarea']="אתר ליקוויד פוקס החדש עלה לאוויר עם אפשרויות חדשות ומגוונות
בקרוב תעלה לכאן המערכת בגירסאת אלפה להורדה..

באתר החדש הפינות הפעילות יהיו:
downloads - פינה שבה ישותפו כל ההורדות של המערכת
ההורדה של המערכת תהיה בעתיד מפוצלת לחלקים שונים שישפיעו על הפונקציונאליות שלה ולא יהיה צורך להוריד את המערכת בשלמותה, אלא לפחות 2 חלקים. למשל אם רוצים רק מערכת חדשות אז מורידים את הבסיס ואת מערכת החדשות, ואם רוצים מערכת תגובות לחדשות אז מורידים גם את מערכת התגובות. דבר זה יאפשר גמישות רבה ללא צורך בעומס של כל המערכת.

Designs - באיזור זה יהיה ניתן לשתף עיצובים שונים למערכת. כבר קיימים עיצובים רבים המחכים להשתחרר לחופשי, אז בתקופה הקרובה אני אשתדל לשתף אותם.

Localizations - תרגומים של המערכת לשפות אחרות. הדבר הראשון שיהיה בו צורך זה לתרגם את המערכת כולה לאנגלית בתור שפה ראשית ולהפוך את העברית לשפה משנית כך שיהיה קליותר לקבוצות אחרות לתרגם את המערכת. עוד אפשרות היא להוסיף אפשרות של תרגום משפה לשפה, כך שאם אתה יודע שפה שהיא לא בהכרח אנגלית ורוצה לתרגם את המערכת אז עדיין זה יהיה אפשרי.

TODO - רשימת המטלות למערכת. כאן נרכז את כל הדברים אשר נותרו לעשות במערכת. אני אעדכן את הרשימה באופן קבוע בשביל המעקב אחרי הפיתוח.

Report a bug - פינת דיווחי הבאגים, כאן תוכלו לדווח על באג שמצאתם במערכת ונוכל לטפל בו. שימו לב שבכדי לדווח על באג יש להתחבר קודם למערכת.";
?>
<a href="index.php?content=textedit_content&amp;nomain=yes">Click here</a>